In [1]:
import pandas as pd                         
import numpy as np        
import pandas
from os import listdir
from os.path import isfile, join
import csv
from sqlalchemy import create_engine

In [2]:
stock_attendance_2017=pd.read_excel(('T19F206.xls'),
              sheet_name='Figure 1') 
stock_attendance_2017_df=pd.DataFrame(stock_attendance_2017)
stock_attendance_2017_df.head()

,Parc et fréquentation des hébergements collectifs en 2017,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,Nombre d'établissements1,Nombre d'hébergements\nen milliers2,Taux d'occupation\nen %,Nuitées totales\nen millions,Nuitées étrangères\nen millions
2,Hôtels,17840,641,61.2,209.9,75.7
3,Campings3,8343,710,35.5,124,38.8
4,Autres hébergements collectifs touristiques (A...,3540,245,62.2,94.8,18.3

In [3]:
#drop row 0
stock_attendance_2017_df=stock_attendance_2017_df.drop([0])

In [4]:
#drop Nan rows
stock_attendance_2017_df=stock_attendance_2017_df.drop([9,10,11,12,13])

In [5]:
#new header
new_header = stock_attendance_2017_df.iloc[0]

In [6]:
stock_attendance_2017_df.columns=new_header

In [7]:
#drop row 0
stock_attendance_2017_df=stock_attendance_2017_df.drop([1])

In [8]:
#rename columns
stock_attendance_2017_df.columns = stock_attendance_2017_df.columns.fillna('type')
stock_attendance_2017_df=stock_attendance_2017_df.rename(columns={"type": "Establishment", "Nombre d'établissements1": "Number_of_Establishments",
                                                                 "Nombre d'hébergements\nen milliers2":"Number_of_Accomidations(thousands)",
                                                                 "Taux d'occupation\nen %":"Occupancy_Rate%",
                                                                 "Nuitées totales\nen millions":"Total_Night(millions)",
                                                                 "Nuitées étrangères\nen millions":"Foreign_Overnight_Stays(millions)"})

In [9]:
stock_attendance_2017_df=stock_attendance_2017_df.rename(columns={"type": "Establishment", "Nombre d'établissements1": "Number_of_Establishments",
                                                                 "Number_of_Accomidations(thousands)":"Number_of_Accomidations",
                                                                 "Occupancy_Rate%":"Occupancy_Rate",
                                                                 "Total_Night(millions)":"Total_Night",
                                                                 "Foreign_Overnight_Stays(millions)":"Foreign_Overnight_Stays"})

In [10]:
#stock_attendance_2017_df

In [11]:
#stock_attendance_2017_df
#conect to local database
rds_connection_string = "postgres:Otis-1995@localhost:5432/france_tourism_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [12]:
engine.table_names()

['stock_attendance_2017',
 'sites_visited_2017',
 'origin_attendance',
 'dom_tour_consumption',
 'eu_attendance',
 'international_receipts']

In [13]:
stock_attendance_2017_df=stock_attendance_2017_df.reset_index()

In [14]:
stock_attendance_2017_df=stock_attendance_2017_df.rename(columns={"index":"id"})

In [ ]:
stock_attendance_2017_df.to_sql(name='stock_attendance_2017', con=engine, if_exists='append', index=False)

In [15]:
sites_visited_2017=pd.read_excel(('T19F206.xls'),
              sheet_name='Figure 2') 
sites_visited_2017_df=pd.DataFrame(sites_visited_2017)
sites_visited_2017_df.head()

,"Monuments, sites culturels et récréatifs les plus fréquentés en 2017",Unnamed: 1
0,NaN,NaN
1,NaN,en milliers de visiteurs
2,NaN,Visiteurs
3,Disneyland,14860
4,Musée du Louvre,8022.3

In [16]:
 #dop frist 3 rows
sites_visited_2017_df=sites_visited_2017_df.drop([0,1,2])

In [17]:
sites_visited_2017_df=sites_visited_2017_df.rename(columns={"Monuments, sites culturels et récréatifs les plus fréquentés en 2017":"Sites",
                                                            "Unnamed: 1":"Number_of_Visitors_Millions"})

In [18]:
sites_visited_2017_df=sites_visited_2017_df.reset_index()

In [19]:
sites_visited_2017_df=sites_visited_2017_df.rename(columns={"index":"id"})

In [20]:
sites_visited_2017_df=sites_visited_2017_df.drop([19])

In [21]:
sites_visited_2017_df=sites_visited_2017_df.drop([15,16,17,18])

In [ ]:
sites_visited_2017_df.to_sql(name='sites_visited_2017', con=engine, if_exists='append', index=False)

In [22]:
origin_attendance_2017=pd.read_excel(('T19F206.xls'),
              sheet_name='Figure 3') 
origin_attendance_2017_df=pd.DataFrame(origin_attendance_2017)
origin_attendance_2017_df.head()

,Fréquentation des hébergements collectifs selon la provenance de la clientèle en 2017,Unnamed: 1,Unnamed: 2
0,NaN,NaN,NaN
1,NaN,NaN,en millions de nuitées
2,NaN,2017.000000,17/16\nen %
3,France,295.963903,5.035282
4,Étranger,132.754125,6.754425

In [23]:
#drop nan and non-data rows
origin_attendance_2017_df=origin_attendance_2017_df.drop([0,1,2,23,24])

In [24]:
#rename columns 
origin_attendance_2017_df=origin_attendance_2017_df.rename(columns={"Fréquentation des hébergements collectifs selon la provenance de la clientèle en 2017":"attendance_origin",
                                                                   "Unnamed: 1":"overnights_mil",
                                                                  "Unnamed: 2":"percentage_change_from_prev_yr"})
#reset index
origin_attendance_2017_df=origin_attendance_2017_df.reset_index()
origin_attendance_2017_df=origin_attendance_2017_df.rename(columns={"index":"id"})

In [ ]:
#send to db
origin_attendance_2017_df.to_sql(name='origin_attendance', con=engine, if_exists='append', index=False)

In [26]:
dom_tour_consumption=pd.read_excel(('T19F206.xls'),
              sheet_name='Figure 4') 
dom_tour_consumption_df=pd.DataFrame(dom_tour_consumption)
dom_tour_consumption_df.head()

,Consommation touristique intérieure en 2017,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,en milliards d’euros
2,NaN,2013.000000,2014.000000,2015.000000,2016.000000,2017
3,Dépense touristique intérieure,140.067892,141.486408,141.508848,138.893016,148.361297
4,Hébergements touristiques marchands,30.760564,31.245199,31.441177,29.896135,32.058217

In [27]:
dom_tour_consumption_df=dom_tour_consumption_df.drop([0,1,14,15])

In [28]:
dom_tour_consumption_df=dom_tour_consumption_df.rename(columns={"Consommation touristique intérieure en 2017":"domestic_accomidations",
                                                                "Unnamed: 1":"2013","Unnamed: 2":"2014","Unnamed: 3":"2015",
                                                                "Unnamed: 4":"2016","Unnamed: 5":"2017"})

In [29]:
dom_tour_consumption_df=dom_tour_consumption_df.drop([2])

In [30]:
dom_tour_consumption_df=dom_tour_consumption_df.rename(columns={"Domestic Accomidations":"domestic_accomidations"})

In [31]:
dom_tour_consumption_df=dom_tour_consumption_df.rename(columns={"2013":"yr_2013","2014":"yr_2014","2015":"yr_2015",
                                                                "2016":"yr_2016","2017":"yr_2017"})

In [32]:
#reset index
dom_tour_consumption_df=dom_tour_consumption_df.reset_index()
dom_tour_consumption_df=dom_tour_consumption_df.rename(columns={"index":"id"})

In [33]:
#check tables
engine.table_names()

['stock_attendance_2017',
 'sites_visited_2017',
 'origin_attendance',
 'dom_tour_consumption',
 'eu_attendance',
 'international_receipts']

In [34]:
dom_tour_consumption_df.head()

,id,domestic_accomidations,yr_2013,yr_2014,yr_2015,yr_2016,yr_2017
0,3,Dépense touristique intérieure,140.067892,141.486408,141.508848,138.893016,148.361297
1,4,Hébergements touristiques marchands,30.760564,31.245199,31.441177,29.896135,32.058217
2,5,Restaurants et cafés,16.031694,16.265275,16.346349,15.601195,16.710100
3,6,Aliments et boissons,12.439159,12.582360,12.618114,12.330291,13.093600
4,7,Serv. de transport non urbain,27.823011,27.797469,29.450758,28.722902,30.972553

In [ ]:
#send to db
dom_tour_consumption_df.to_sql(name='dom_tour_consumption', con=engine, if_exists='append', index=False)

In [35]:
EU_attendance=pd.read_excel(('T19F206.xls'),
              sheet_name='Figure 5') 
EU_attendance_2017_df=pd.DataFrame(EU_attendance)
EU_attendance_2017_df.head()

,Fréquentation des hébergements collectifs dans quelques pays de l'UE en 2017,Unnamed: 1,Unnamed: 2
0,NaN,NaN,NaN
1,NaN,Nuitées\nen millions,Nuitées des non-résidents\nen %
2,Allemagne,401.163218,20.72
3,Autriche,121.126543,71.04
4,Belgique,38.677308,48.24

In [36]:
EU_attendance_2017_df=EU_attendance_2017_df.rename(columns={"Fréquentation des hébergements collectifs dans quelques pays de l'UE en 2017":"eu_countries",
                                                           "Unnamed: 1":"overnight_stays_mil","Unnamed: 2":"non_res_overnights_mil"})

In [37]:
EU_attendance_2017_df=EU_attendance_2017_df.drop([0,1,16,17,18])

In [38]:
#rest index
EU_attendance_2017_df=EU_attendance_2017_df.reset_index()

In [39]:
EU_attendance_2017_df=EU_attendance_2017_df.rename(columns={"index":"id"})

In [42]:
#EU_attendance_2017_df=EU_attendance_2017_df.drop(columns=["level_0"])
EU_attendance_2017_df.head()

   id eu_countries overnight_stays_mil non_res_overnights_mil
0   2    Allemagne          401.163218                  20.72
1   3     Autriche          121.126543                  71.04
2   4     Belgique           38.677308                  48.24
3   5      Croatie           86.094847                  93.13
4   6      Espagne          471.199729                  64.92

In [ ]:
EU_attendance_2017_df.to_sql(name='eu_attendance', con=engine, if_exists='append', index=False)

In [61]:
#sheet 6
int_receipts=pd.read_excel(('T19F206.xls'),
              sheet_name='Figure 6') 
int_receipts_2017_df=pd.DataFrame(int_receipts)
int_receipts_2017_df.head()

,Recettes du tourisme international,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,en milliards d'euros
2,Rang,Pays récepteur,1990,2000,2017 (p),Évolution annuelle\n2017/2000 en %
3,1,États-Unis,33.837056,108.5,186.6,3.240923
4,2,Espagne,14.542845,33.4,60.3,3.536243

In [62]:
int_receipts_2017_df=int_receipts_2017_df.rename(columns=int_receipts_2017_df.iloc[2])

In [63]:
int_receipts_2017_df.head()

,Rang,Pays récepteur,1990,2000,2017 (p),Évolution annuelle\n2017/2000 en %
0,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,en milliards d'euros
2,Rang,Pays récepteur,1990,2000,2017 (p),Évolution annuelle\n2017/2000 en %
3,1,États-Unis,33.837056,108.5,186.6,3.240923
4,2,Espagne,14.542845,33.4,60.3,3.536243

In [64]:
int_receipts_2017_df=int_receipts_2017_df.rename(columns={list(int_receipts_2017_df)[0]:"rank",
                                                         list(int_receipts_2017_df)[1]:"receiving_country",
                                                         list(int_receipts_2017_df)[2]:"yr_1990",
                                                         list(int_receipts_2017_df)[3]:"yr_2000",
                                                         list(int_receipts_2017_df)[4]:"yr_2017",
                                                         list(int_receipts_2017_df)[5]:"change_from_2000"})

In [65]:
int_receipts_2017_df=int_receipts_2017_df.drop([0,1,22,23,24,25,26,27])

In [66]:
#int_receipts_2017_df=int_receipts_2017_df.drop(columns="rank")
int_receipts_2017_df.head()

,rank,receiving_country,yr_1990,yr_2000,yr_2017,change_from_2000
2,Rang,Pays récepteur,1990,2000,2017 (p),Évolution annuelle\n2017/2000 en %
3,1,États-Unis,33.837056,108.500000,186.6,3.240923
4,2,Espagne,14.542845,33.400000,60.3,3.536243
5,3,France,15.881158,35.705000,53.7,2.429768
6,4,Thaïlande,3.403611,8.104798,50.9,11.413994

In [67]:
int_receipts_2017_df=int_receipts_2017_df.drop([2])

In [68]:
int_receipts_2017_df=int_receipts_2017_df.reset_index()
int_receipts_2017_df=int_receipts_2017_df.rename(columns={"index":"id"})

In [69]:
int_receipts_2017_df.head()

   id rank receiving_country    yr_1990     yr_2000 yr_2017 change_from_2000
0   3    1        États-Unis  33.837056  108.500000   186.6         3.240923
1   4    2           Espagne  14.542845   33.400000    60.3         3.536243
2   5    3            France  15.881158   35.705000    53.7         2.429768
3   6    4         Thaïlande   3.403611    8.104798    50.9        11.413994
4   7    5       Royaume-Uni  12.096746   23.654235    45.3         3.896130

In [ ]:
int_receipts_2017_df.to_sql(name='international_receipts', con=engine, if_exists='append', index=False)

In [90]:
#dfs to csvs
#sites_visited_2017_df.to_csv(r'Kat_data/Clean \sites_visited_2017.csv', index = False)
stock_attendance_2017_df.to_csv(r'stock_attendance_2017.csv', index = False)
origin_attendance_2017_df.to_csv(r'origin_attendance_2017.csv', index = False)
dom_tour_consumption_df.to_csv(r'domestic_tourism_consumption_2017.csv', index = False)
EU_attendance_2017_df.to_csv(r'EU_attendance_2017.csv', index = False)
int_receipts_2017_df.to_csv(r'international_receipts_2017.csv', index = False)

In [89]:
sites_visited_2017_df.to_csv(r'sites_visited_2017.csv', index = False)